{
  "asin_from_details": "B0DNJS1K11",
  "title": "8pcs Base Plates Multipack Classic Baseplate Building Plates for Bricks 16x16 Architectural Panels Create Pixel Paintings & Wall Displays Compatible with Major Brick Brands (Black)",
  "current_price": 14.39,
  "original_price": 17.99,
  "main_image": "https://m.media-amazon.com/images/I/71vu1oHYSGL._AC_SL1500_.jpg",
  "thumbnails": [
    "https://m.media-amazon.com/images/I/51JBSW160GL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/51vrpDuTvnL._SL1500_.jpg",
    "https://m.media-amazon.com/images/I/5192Fhoo9IL._SL1500_.jpg"
  ],
  "high_res_gallery": [],
  "amazon_product_details_section": {
    "Date First Available": "8 Feb. 2025"
  },
  "date_first_available_from_details": "8 Feb. 2025",
  "prime_eligible": true,
  "fulfilled_by_amazon": false,
  "seller_info_text": "Xinshi",
  "sold_by_amazon": false,
  "rating": 4.8,
  "review_count": 7,
  "availability_text": "In stock",
  "in_stock": true,
  "features": [
    "High - Quality Material: This set includes 8 pieces of 65803 brick 16 x 16 architectural panels designed for classic base architectural bricks. Crafted from premium ABS material, they feature a glossy and colorful surface, ensuring durability and vibrant aesthetics.",
    "Unlimited Expansion: Equipped with a special extension spigot, these base plates offer endless expansion possibilities. You can effortlessly cover an entire wall in your home, creating a large - scale display or project.",
    "Creative Pixel Paintings: Ideal for making pixel paintings, these base plates allow you to use the mainstream building blocks at hand. Unleash your creativity and assemble captivating paintings that showcase your unique imagination.",
    "Tight Connection and Versatile Use: The base plates connect snugly without leaving any gaps. They can serve as a solid foundation base plate or a building floor, assisting you in constructing your dream building with ease.",
    "Help and Support: Not sure how to start your own pixel art project? No worries! Feel free to reach out to us via Amazon - our team is here to offer guidance and support to help you bring your creative ideas to life."
  ],
  "description": "Product description Are you an enthusiast of building bricks and looking for the perfect accessories to take your creations to the next level? Look no further than our piece base plates multipack! Introduction to the Product These building plates are specifically designed for classic base architectural bricks 65803. They come in a sleek black color in a convenient 16x16 size, which is not only highly flexible but also a great addition to your existing building block collection. Superior Material Quality Constructed from high - quality ABS material, our base plates offer remarkable strength and resilience. Their glossy colorful surface not only adds an aesthetic touch but also provides a smooth finish, making them pleasant to work with. You can be confident that these plates will stand up to constant handling and multiple building sessions. Unlimited Expansion Feature One of the most exciting aspects of these base plates is the special extension spigot. With this ingenious design, you're not limited by the area of a single plate. You can connect multiple plates together without any hassle, enabling you to cover an entire wall in your room. Imagine turning your living room or bedroom into a custom - built, block - based art gallery! Creative Pixel Painting The potential for creating pixel paintings is boundless. Use the mainstream building blocks that you already have at your disposal. By placing the bricks onto these base plates, you can let your imagination soar and craft captivating designs. From simple geometric patterns to complex portraits, the choice is yours. These plates act as the perfect canvas for your unique creative expression. Versatile Usage Whether you're constructing a small model or a large - scale architectural masterpiece, these base plates will prove to be an invaluable asset. They connect tightly, leaving no gaps, ensuring a stable construction. You can use them as a solid foundation base plate for your builds, or transform them into a building floor. They offer the stability and support needed to bring your ideal building to life. Customer Assistance We understand that creating pixel art can seem daunting at first, especially if you're new to the concept. That's why we're here to support you. If you have any questions about making your own pixel art, simply contact us through Amazon. Our team of experts is more than happy to provide you with tips, tricks, and inspiration to help you achieve your creative goals. Invest in our base plates multipack today and embark on a journey of endless building and creative possibilities! Safety Warning Contains small parts, do not swallow",
  "specifications_table": {
    "Product Dimensions": "‎12.95 x 12.95 x 1.52 cm; 470 g",
    "Manufacturer recommended age": "‎6 years and up",
    "Item model number": "‎X-040",
    "Assembly Required": "‎No",
    "Batteries Required?": "‎No",
    "Batteries included?": "‎No",
    "Material Type(s)": "‎Plastic",
    "Colour": "‎Black(8pcs)",
    "ASIN": "‎B0DNJS1K11"
  },
  "selleramp": {
    "status": "SellerAmp extraction disabled"
  },
  "keepa": {
    "status": "Extraction process completed",
    "sales_rank_details_table": {
      "main_cat_current_rank": 31416,
      "main_cat_name": "Toys & Games 10 drops / month",
      "sub_cat_current_rank": 51,
      "sub_cat_name": "Toy Interlocking Building Accessories 2"
    },
    "ai_graph_analysis_status": "Keepa Graph AI Analysis disabled",
    "product_details_tab_data": {
      "Title": "8pcs Base Plates Multipack Classic Baseplate Building Plates for Bricks 16x16 Architectural Panels Create Pixel Paintings & Wall Displays Compatible with Major Brick Brands (Black)",
      "Sales Rank - Reference": "Toys & Games",
      "Sales Rank - Display Group": "toy_display_on_website",
      "Reviews - Rating": 4.8,
      "Reviews - Rating Count": 7.0,
      "Last Price Change": "just now",
      "Buy Box Seller": "Xinshi (100% positive over last 12 months)",
      "Lowest FBA Seller": "Xinshi (100% positive over last 12 months)",
      "FBA Pick&Pack Fee": 3.04,
      "Referral Fee %": "15.01 %",
      "Referral Fee based on current Buy Box price": 2.7,
      "Total Offer Count": "1",
      "Tracking since": "2025/02/15",
      "Listed since": "2025/02/08",
      "Categories - Root": "Toys & Games",
      "Categories - Sub": "Storage & Accessories",
      "Categories - Tree": "Toys & Games › Building & Construction Toys › Storage & Accessories",
      "Website Display Group - Name": "Kitchen",
      "ASIN": "B0DNJS1K11",
      "Product Codes - UPC": "767065803105",
      "Product Codes - EAN": "0767065803105",
      "Product Codes - PartNumber": "X-040",
      "Parent ASIN": "B0DNJPY3DV",
      "Variation ASINs": "B0DNJQ6DZ7, B0DNJRMDVP, B0DNJS1K11, B0DNJRXZKQ, B0DNJQ181C, B0DNJRN99M, B0DNJRV9FL",
      "Freq. Bought Together": "B0CYPTYS8F",
      "Type": "ANTI_FATIGUE_FLOOR_MAT",
      "Manufacturer": "Xinshi",
      "Brand": "XIN·SHI",
      "Brand Store Name": "XIN·SHI",
      "Brand Store URL Name": "XIN·SHI",
      "Brand Store URL": "https://www.amazon.com/stores/XIN·SHI/page/BBFC2075-8928-475B-BA28-6A77ED55BAFD",
      "Product Group": "Furniture",
      "Model": "X-040",
      "Color": "Black(8pcs)",
      "Unit Details - Unit Value": "1",
      "Material": "Plastic",
      "Package - Dimension (cm³)": "13.1 x 13.1 x 11.4 cm (= 1,956 cm³ )",
      "Package - Weight (g)": "470",
      "Item - Dimension (cm³)": "13.0 x 13.0 x 1.5 cm (= 254 cm³ )",
      "Included Components": "Base plate and bolt",
      "Safety Warning": "Contains small parts, do not swallow"
    }
  },
  "eans_on_page": [
    "0767065803105"
  ],
  "ean_on_page_source": "Keepa_Product_Details",
  "ean_on_page": "0767065803105",
  "sales_rank": 31416,
  "category": "Toys & Games 10",
  "sales_rank_source": "Keepa_SalesRankDetailsTable",
  "estimated_monthly_sales_from_bsr": 30,
  "asin_extracted_from_page": "B0DNJS1K11",
  "asin_queried": "B0DNJS1K11",
  "asin": "B0DNJS1K11"
}